#include "stdafx.h"
#include "ges_initial.h"

bool ges_initial()
{
	short rtn =0 ; //电机操作后的返回值，0表示无错误
	//**********************************************************************************
	//电机平台初始化 
	//**************//括号内的数字为关于平台运行的程序共有多少段，注释掉所有后，相机才可单独运行！！！
	//**************//现在总共为(9)段
	//**********************************************************************************
	/*(1)*/
	rtn = GT_System_Initinal();//平台初始化
	if(rtn!=0)
	{
		printf("电机初始化失败！\n");
		return false;

	}

	rtn = AxisInitial(2,15);									//控制轴初始化函数						
	if(rtn!=0)
	{
		printf("电机控制轴初始化失败！\n");
		return false;
	}															   
	rtn = MotionInitial();										//轴运动参数初始化
	if(rtn!=0)
	{
		printf("电机控制轴运动参数初始化失败！\n");
		return false;
	}
	return true;
}